from aiogram import Router
from aiogram.types import Message
from aiogram.filters import Command

router = Router()

@router.message(Command("help"))
async def help_command(message: Message):
    text = (
    "❓ *Допомога та можливості бота*\n\n"
    "🧪 *Проходження тестів*\n"
    "У головному меню ви можете пройти психологічні тести, які допомагають краще зрозуміти свій стан\\.\n"
    "_Це не є діагнозом_, але може бути першим кроком до усвідомлення\\.\n"
    "Доступно до *3 інтерпретацій* ШІ результатів на день\\.\n"
    "Після проходження можна згенерувати *PDF\\-звіт* — щоб показати психологу або зберегти для себе\\.\n"
    "Кількість таких звітів — *необмежена*\\.\n\n"
    "🤖 *ШІ\\-консультант «Кіт Нейрон»*\n"
    "Можна задати до *10 питань на день*\\. Він відповідає емпатично і з опорою на доказову психологію\\.\n"
    "Якщо запит серйозний — порадить звернутись до фахівця\\.\n\n"
    "📬 *Анонімний зворотний зв'язок*\n"
    "Можеш поділитися думкою, багом або ідеєю через команду /feedback — і бот анонімно передасть це адміну\\.\n\n"
    "👣 *Рестарт бота*\n"
    "Якщо щось зависло або пішло не так — просто надішли команду /start\\.\n\n"
    "🐾 _Цей бот діє відповідально та етично\\. Тут безпечно\\._"
)

    await message.answer(text, parse_mode="MarkdownV2")
